{
  "loading": [
    "Dodo Information System",
    "Version 1.02d",
    "© Dodo Brands, 2020 – до сих пор",
    "Memory (Kb): 256",
    "",
    "Loaded config:",
    "Bullshit mode [OFF]",
    "Development mode [STEP BY STEP]",
    "Refactoring mode [MEDIUM]",
    "Unit - tests [REQUIRED]",
    "Legacy code [MEDIUM]",
    "",
    "Booting from Hard Disk..."
  ],
  "help": [
    "Все доступные команды:",
    "",
    "> home",
    "> stack",
    "> business",
    "> jobs",
    "> test",
    "> github",
    "> habr",
    "> vk",
    "> telegram",
    "> twitter",
    "> youtube",
    "",
    "а может и не все :)"
  ],
  "home": [
    "Hi %username%",
    "",
    "Dodo Engineering still hasn’t you.",
    "Follow the RabbitMQ.",
    "",
    "Мы – разработчики в Dodo: «blameless culture» + «no bullshit». Боремся с англицизмами, используем их и снова боремся. Создаём систему Dodo IS. Она — симбиоз ERP, HRM и CRM-систем. Она управляет всем бизнесом Dodo.",
    "",
    "Мы работаем в %countries-count% странах. В планах весь мир. Нам нужен ты.",
    "",
    "Введи, чтобы продолжить:",
    "> business",
    "> stack",
    "> jobs",
    "> test",
    "> help"
  ],
  "homeMng": [
    "Hi %username%",
    "",
    "Dodo Engineering still hasn’t you.",
    "Follow the RabbitMQ.",
    "",
    "Мы – разработчики в Dodo: «blameless culture» + «no bullshit». Боремся с англицизмами, используем их и снова боремся. Создаём систему Dodo IS. Она — симбиоз ERP, HRM и CRM-систем. Она управляет всем бизнесом Dodo.",
    "",
    "Мы работаем в %countries-count% странах. В планах весь мир. Нам нужен ты."
  ],
  "stack": [
    "• .NET 6, переходим постепенно на .NET 7:",
    "  ASP.NET Core в монолите в k8s (что? да!)","  –  15 сервисов;",
    "  ASP.NET Core вне монолита в k8s","  – 75 сервисов.",
    "",
    "• На сайте и в бекофисе React + TypeScript. В бэкофисе остались уголки с jQuery и AngularJS, но мы активно оттуда уходим.",
    "",
    "• 36 баз MySql на кластерах, кроме dev окружений.",
    "",
    "• Всё на Azure, с использованием RabbitMQ (местами Kafka / Azure Event Hubs), Kusto, CosmosDB, Redis и еще много мелких радостей.",
    "",
    "• Все новые сервисы мы пишем на .NET, под Linux, запускаем в Kubernetes.",
    "",
    "• Детальный мониторинг на продакшене на базе Prometheus, сбор логов в Kusto, визуализация в Grafana. А пейджер для дежурного вместо PagerDuty мы написали сами!",
    "",
    "• Работа по скраму с ежедневными стендапами, планированием, общением с бизнесом.",
    "",
    "",
    "Посмотреть наши проекты можно тут:"
  ],
  "business": [
    "Для создания всемирной системы Dodo IS нам нужно больше разработчиков.",
    "",
    "Бизнес – это %stores-count% точек питания в %countries-count% странах (Великобритания, Нигерия, Вьетнам, etc.), 22 000 000+ клиентов, 350 заказов в минуту (стандарт), 510 заказов в минуту (в пики), 614 заказов в минуту (зафиксированный максимум), 1200+ заказов в минуту (держим в нагрузочном тестировании), 5800 RPS, 58 млрд рублей – выручка сети за 2022 год.",
    "",
    "Dodo IS – это коллаборация ERP+HRM+CRM-систем, которую мы пишем сами. Бонусом драйвим клиентские сайты, свои киоски и мобильное приложение.",
    "",
    "Приходи, мы платим не пиццей, а деньгами. Ещё есть опцион.",
    "",
    "Почитать о бизнесе можно тут:"
  ],
  "jobs": [],
  "jobs.backup": [
    "Мы работаем небольшими",
    "кросс-функциональными командами",
    "по 4-5 человек. Сегодня у нас 35 команд, и это не предел.",
    "",
    "FYI: есть тема с удалёнкой и релокацией.",
    "",
    "Сейчас мы ищем: "
  ],
  "test": [
    "Эй, кожаный мешок, ты заснул 31 декабря 2020 года, а проснулся 1 января 2120. Сейчас мы возьмём твою ДНК и проведём тест, чтобы выдать новую профессию."
  ],
  "notexist": [
    "Такой команды нет, для списка всех команд введи:",
    "",
    "> help"
  ],
  "pizza": [
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣶⣶⣦⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣷⣤⠀⠈⠙⢿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⣿⠆⠰⠶⠀⠘⢿⣿⣿⣿⣿⣿⣆⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⠏⠀⢀⣠⣤⣤⣀⠙⣿⣿⣿⣿⣿⣷⡀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⢠⠋⢈⣉⠉⣡⣤⢰⣿⣿⣿⣿⣿⣷⡈⢿⣿⣿⣿⣿⣷⡀",
    "⠀⠀⠀⠀⠀⠀⠀⡴⢡⣾⣿⣿⣷⠋⠁⣿⣿⣿⣿⣿⣿⣿⠃⠀⡻⣿⣿⣿⣿⡇",
    "⠀⠀⠀⠀⠀⢀⠜⠁⠸⣿⣿⣿⠟⠀⠀⠘⠿⣿⣿⣿⡿⠋⠰⠖⠱⣽⠟⠋⠉⡇",
    "⠀⠀⠀⠀⡰⠉⠖⣀⠀⠀⢁⣀⠀⣴⣶⣦⠀⢴⡆⠀⠀⢀⣀⣀⣉⡽⠷⠶⠋⠀",
    "⠀⠀⠀⡰⢡⣾⣿⣿⣿⡄⠛⠋⠘⣿⣿⡿⠀⠀⣐⣲⣤⣯⠞⠉⠁⠀⠀⠀⠀⠀",
    "⠀⢀⠔⠁⣿⣿⣿⣿⣿⡟⠀⠀⠀⢀⣄⣀⡞⠉⠉⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠀⡜⠀⠀⠻⣿⣿⠿⣻⣥⣀⡀⢠⡟⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⢰⠁⠀⡤⠖⠺⢶⡾⠃⠀⠈⠙⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠈⠓⠾⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
  ],
  "game": [],
  "contacts": [
    "Мы занимаемся сайд-проектами:"
  ],
  "aboutdodo": [
    "Мы, команда Додо Инжиниринга, уже больше 2 лет помогаем сетям быстрого питания разрабатывать и поддерживать IT-проекты и программные продукты. Наш крупнейший клиент – бренд Додо Пицца.",
    "За это время мы помогли бизнесу Додо Пиццы масштабироваться на 17 стран, заполучить лояльность более чем 22 миллионов клиентов и ежемесячную аудиторию около 3,5 миллионов человек. Наши IT-решения позволяют выдерживать нагрузку до 760 заказов в минуту и одновременно обслуживать клиентов в более чем 900 точках питания.",
    "Мы участвуем в разработке и поддержке клиентских и курьерских мобильных приложений, всех интерфейсов для размещения заказа, автоматизацией всего жизненного цикла точки питания, платформы для работы с данными, бэкенда для всех этих продуктов и решением инфраструктурных задач."
  ],
  "dodois": [
    "Мы разрабатываем мультифункциональную платформу Додо ИС для ресторанов быстрого питания  — это информационная система, на базе которой работают ресторанные концепции Додо Брендс: Додо Пицца, Дринкит, Донер 42. Она включает в себя сервисы для управления бизнесом, клиентские приложения и сайт. Это комплексное решение, которое позволяет: принимать и обрабатывать заказы; автоматически управлять технологическим процессом на кухне ресторанов; управлять персоналом; управлять доставкой (собственное приложение для курьеров); автоматически вести учёт продуктов; интегрироваться с агрегаторами по доставке еды, эквайринговыми системами; быстро настраивать кассовое оборудование для соблюдения налоговой отчётности. "
  ],
  "newstack": [
    ".NET 6: ASP.NET Core в монолите – 16 сервисов; ASP.NET Core вне монолита в k8s – 30 сервисов.",
    "На фронтенде React и TypeScript. 32 базы MySql на кластерах, кроме dev-окружений.",
    "Всё на Azure и Яндекс.Облаке, с использованием RabbitMQ (местами Kafka, Azure Event Hubs), Kusto, CosmosDB, Redis.",
    "Все сервисы мы пишем на .NET, под Linux, запускаем в Kubernetes.",
    "Детальный мониторинг на продакшене на базе Prometheus, сбор логов в Kusto, визуализация в Grafana, пейджер для дежурного."
  ],
  "aboutRestService": [
    "Задача: Создание системы управления рестораном, автоматизирующей и оцифровывающей все процессы, от открытия кассовой смены на конкретной кассе до предоставления дашбордов с данными для принятия менеджментом сети решений.",
    "Решение: Разработали ERP-систему с функционалом для управления пиццерией для менеджера смены, менеджера офиса, системой для проведения ревизий и системой автоназначения Небесный логист.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript.",
    "Административная часть: Функциональность в интерфейсе Менеджера смены: Управление кассовой сменой и кассовой отчетностью. Операционные показатели кухни и доставки: выручка и количество заказов, время ожидания, количество курьеров на смене по дням, неделям. История заказов на пиццерию и все данные по ним.",
    "Временная остановка продаж по всей пиццерии или по конкретным ингридиентам, продуктам, секторам доставки. Управление остатками и заготовками продуктов, приемка и списание продуктов. Управление подключением устройств в пиццерии: Трекеров, Касс, Телевизоров.",
    "Функциональность в интерфейсе Менеджера офисы для управляющих, менеджеров маркетинговых кампаний и прочих сотрудников офиса Партнера Додо Брэндс: Управление локальными маркетинговыми акциями. Метрики пиццерий на масштабе города, а не одного ресторана. Отчеты по прибылям и убыткам (P&L). Показатели секторов доставки. Редактор секторов доставки. Метрики эффективности маркетинговых акций. Аналитика по браку: процент брака готовых продуктов, их виды, этап, на котором случился брак. Аналитика популярности продуктов. Система для проведения ревизий: Позволяет оценить расход и остатки по продуктам в пиццерии в рамках ежемесячной ревизии. Специальный планшет для проведения ревизий позволяет проводить эту большую работу синхронно нескольким сотрудникам, ничего не забывая зафиксировать. Планшет работает в оффлайн-режиме, чтобы обеспечивать возможность ревизии в холодильной камере без связи.",
    "Система автоназначения Небесный логист: Строит оптимальные маршруты курьеров, опираясь на карту секторов, объем и состав заказов. Автоматически назначает курьеров на заказы, подсказывает им сроки доставки и возврата в пиццерии.",
    "Благодаря чему снижает количество опозданий курьеров и как следствие затраты на выдачу промокодов в случае опоздания."
  ],
  "aboutPeopleService": [
    "Задача: Автоматизировать рутинные задачи и сбор аналитики HR-партнерами пиццерий. ",
    "Решение: Разработаны отчеты и интерфейсы по всему жизненному циклу сотрудника пиццерии от найма и выхода на смену по графику до расчета зарплат и аналитики по labor cost. Разработан интерфейс Базы Знаний.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript.",
    "Административная часть: HR-партнерам пиццерий доступна аналитика по: Labor cost. Приему и увольнениям. Эффективности источников найма. Сервисы работы с сотрудниками ресторана позволяют: Устанавливать графики смен работы сотрудников. Устанавливать меню и расписание обедов. Расчитывать оплату за сверхурочные и оплату работ.",
    "База знаний: Помогает в адаптации новых сотрудников, содержит в себе все нужные инструкции.  Позволяет передавать информацию об обновлениях Додо ИС сразу всей сети ресторанов."
  ],
  "aboutControllingService": [
    "Задача: Автоматизировать рутинные задачи и создать интерфейсы для работы сотрудников отдела Оценки Качества работы пиццерий.",
    "Решение: Разработана модель машинного обучения, которая вместо человека может оценить качество приготовленной пиццы и статус маркированной продукции в ресторане по фотографии. Разработан личный кабинет для сотрудников Оценки Качества для анализа автоматизированных результатов и подведения итогов по проверкам пиццерий.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript. Azure Databricks, Petastorm, MLFlow",
    "Административная часть: Личный кабинет сотрудников Оценки Качества позволяет анализировать автоматически и вручную собранные результаты проверки работы пиццерий, подводить итоги по проверкам и присваивать рейтинг качества пиццериям. Машинное обучение позволяет загружать в этот личный кабинет уже обработанные и проверенные автоматически фото, с результатами обработки которых можно согласиться одним кликом или скорректировать в случае ошибки модели.",
    "Подробно кейс с ML описан на Хабре"
  ],
  "aboutKitchenService": [
    "Задача: Разработать автоматизированную систему управления сотрудниками кухни, напоминающую о новых заказах.",
    "Решение: Разработали интеграцию с голосовым помощником Оленька, направляющим действия сотрудников кухни.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes."
  ],
  "aboutFranchizeSupport": [
    "Задача: Обеспечить техническую поддержку франчайзи и сотрудников их офисов.",
    "Решение: Создали команду технической поддержки франчайзи, принимающую сообщения о проблемах. Команда технической поддержки обрабатывает входящие заявки, помогает в настройке и запуске оборудования при старте работы пиццерии, помогает разобраться с интерфесами Додо ИС и эскалирует проблемы в команды разработки сервисов, если не может решить их для франчайзи самостоятельно. ",
    "Технологии: Pyrus и самостоятельно разработанные на .NET сервисы автоматизации работы с заявками."
  ],
  "aboutCustomerService": [
    "Задача: Разработать Платформу Управления Ценностью для Клиента (Customer Value Management, CVM), позволяющую повышать лояльность и возвращаемость клиентов Додо Пицца и бороться с оттоком клиентов.",
    "Решение: Разработали Программу лояльности, в которую входят интегрированные в мобильное приложение Додо Пицца Профиль клиента, Коин стор, Персональные промо-цены в меню, Персональные акции, Персональные миссии и Система уведомлений о них.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes. Мобильные приложения написаны и поддерживаются на Swift и Kotlin." ,
    "Дизайн: Разработали дизайн соответствующих частей приложения, интегрирующийся в общую дизайн-систему и расширяющий возможности приложения для заказа Додо Пиццы.",
    "Административная часть: Разработали административную часть, позволяющую менеджеру рекламных кампаний и инженеру данных сегментировать клиентов и формировать в клиентском приложении Додо Пицца индивидуальные персональные акции и миссии для них. Приложение: Профиль клиента позволяет ознакомиться со всеми доступными акциями и миссиями, количеством Додо Коинов и способами их использования.  В Коин сторе клиент может обменять полученные за заказы или участие в промо-активностях Додо Коины на продукты при любом заказе в Додо Пицце.  Персональные промо-цены в меню отображаются прямо внутри основного интерфейса меню в мобильном приложении и показывают краткосрочно доступную скидку на конкретный продукт для конкретного клиента. Персональные акции в Профиле клиента регулярно обновляются и позволяют получить дополнительную скидку или накопить дополнительные Додо Коины за совершение заказа определенного типа или состава. Персональные миссии формируются в Профиле клиента и позволяют получать Додо Коины за определенные действия, например за заполнение анкеты или участие во флешмобе."
  ],
  "aboutIOT": [
    "Задача: Разработать способ выдачи заказов, который позволит не взаимодействовать с каждым клиентом Дринкита на выдаче лично, и снимет часть рутинной работы с персонала ресторана.",
    "Решение: Была разработана Умная выдача: полностью спроектированная и запрограммированная нами система, показывающая номер и статус заказа и позволяющая забрать свой заказ самостоятельно по готовности.",
    "Технологии: Мы находимся в процессе получения патента и не готовы разглашать использованные технологии.",
    "Дизайн: Был разработан дизайн умной выдачи, учитывающий и объем заказов в кофейне, и уже имеющийся дизайн помещений, и привычный клиентский опыт посетителя кофейни. В дальнейшем мы смогли адаптировать решение и дизайн и для Додо Пиццы, сейчас проходит тестирование Умной выдачи в пиццериях.",
    "Административная часть: Была разработана интеграция Умной выдачи с Додо ИС для синхронизации статуса заказа. "
  ],
  "aboutContactCenter": [
    "Задача: Автоматизировать процессы Контактного центра для клиентов с целью ускорения сбора обратной связи и формирования заказов для клиентов, которые по тем или иным причинам не могут воспользоваться для этого сайтом или мобильным приложением.",
    "Решение: Разработали административную панель Контактного центра Додо Пиццы, в которой специалист Контактного центра может проверять и управлять статусом заказа.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript.",
    "Административная часть: Административная панель сотрудника Контактного центра позволяет уточнять статус работы пиццерии, формировать заказ для клиента на удобных ему условиях (доставка, самовывоз, заказ ко времени). Благодаря разработанной функциональности специалист Контактного центра может найти все активные заказы и подсказать их статус, внести корректировки по запросу клиента во время звонка."
  ],
  "aboutProcessingOrder": [
    "Задача:Разработать Платформу обработки заказов, обеспечивающую все процессы работы с заказом: формирование и управление меню, автоматизацию оформления заказа, обеспечение работоспособности максимального числа способов оплаты во всех странах присутствия.",
    "Решение: Была разработана Ordering Platform (Платформа обработки заказов), включающая в себя сервисы, полностью покрывающие клиентский путь при формировании заказа от выбора продукта и до проведения оплаты: Меню, Оформление заказа, Платежи.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript, Swift, Android.",
    "Административная часть: Сервис Меню (Menu) позволяет централизованно управлять меню и ценообразованием, показывать одинаковое доступное меню в мобильном приложении и в пиццерии. Сервис Оформление заказа (Checkout) обеспечивает интеграции со всеми способами формирования заказа: мобильное приложение Додо Пицца, сайт Додо Пицца, Киоски, и открывает возможности для будущих интеграций по открытому API. Сервис Платежи гарантирует поддержку 10 методов оплаты (таких как сохраненные карты, оплата СБП и так далее) в 17 странах."
  ],
  "aboutSystemInitialOrder": [
    "Задача: Разработать масштабируемую систему приема заказов вне мобильного приложения: в ресторане на Кассе, в Киоске самообслуживания, с возможностью подключать необходимую технику для приема заказа согласно законодательству разных стран.",
    "Решение: Разработали веб-интерфейс Кассы ресторана для упрощения работы кассира, интерфейс заказа в Киоске самообслуживания и плагинную систему для масштабирования решения на разные страны. ",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript. ",
    "Дизайн: Для Киосков самообслуживания разработан уникальный дизайн интерфейса, отличный от дизайна мобильного приложения и адаптированный именно для условий Киоска, чтобы обеспечить максимально быстрый и понятный выбор продукта и простой процесс оплаты.",
    "Административная часть: Веб-интерфейс Кассы ресторана позволяет войти от имени того или иного кассира, набрать продукты по заказу клиента, модифицировать их состав, добавляя или убирая ингридиенты согласно пожеланиям. Также с помощью интерфейса кассир может формировать комбо со скидкой для клиента, оформлять заказ в зале или с собой на имя клиента, предоставлять выбор варианта оплаты картой или наличными. Плагинная система позволяет разрабатывать интеграции с кассовой техникой, обязательной к использованию в разных странах, с привлечением аутсорса или команд разработки на стороне франчайзи, ускоряя запуск сети в новой стране. "
  ],
  "aboutGlobalStart": [
    "Задача: Упростить и ускорить открытие пиццерий Додо Пицца в новых странах с точки зрения процесса развертывания Додо ИС.",
    "Решение: Сформировали проектную команду Глобальных запусков, которая уже запустила Додо Пиццу в Дубае и готовится к запуску еще трех стран.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript, Swift, Android.",
    "Дизайн: Адаптировали дизайн приложения, все тексты и расположение кнопок, все иллюстрации для арабского языка и удобства восприятия жителем ОАЭ.",
    "Административная часть: Разработали и запустили Мультиномер: впервые оформить заказ в стране стало можно на номер телефона из другой страны, что очень актуально для Дубая, где много приезжих. ",
    "Приложение: Полностью адаптировали все интерфейсы приложения к восприятию справа налево: от каждой надписи до направленности изображения на иконках и иллюстраций.  Описали подробно кейс адаптации приложения для ОАЭ на Хабре (оттуда же можно надергать скрины)"
  ],
  "aboutCustomerExp": [
    "Задача: Создать инструменты для улучшения клиентского опыта в ресторане: анимированные меню на телевизорах на кассе, доставку до столика, демонстрацию статуса заказа в зале ресторана.",
    "Решение: Разработали сервисы автоматического обновления меню и цен из центрального офиса на экранах в ресторанах, добавили в приложение функциональность доставки заказа до столика в ресторане, разработали синхронизацию Додо ИС с телевизором, показывающим статусы всех активных заказов для клиентов. ",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes, React, TypeScript, Swift, Android. ",
    "Дизайн: Разработали дизайн ТВ-бордов с меню, адаптирующийся под текущие запросы бизнеса и активные промо-акции на уровне страны и города. ",
    "Административная часть: Разработали функционал для загрузки обновленных картинок меню и цен централизованно на все необходимые экраны на кассе во всех необходимых ресторанах.",
    "Приложение: Добавили в мобильные приложения возможность заказа не только с собой или с забором заказа на кассе клиентом, но и с доставкой до столика по QR-коду на столике, распознаваемому через мобильное приложение. "
  ],
  "aboutTechService": [
    "Инфраструктура и надежность (SRE)",
    "Задача: Обеспечивать надежность Додо ИС, снизить количество рутинных операций, повысить автономность команд разработки.",
    "Решение: Настроить сбор данных и мониторинг, научить разработчиков SRE-практикам, внедрить дежурства, разработать систему инцидент-менеджмента.",
    "Технологии: Azure, Yandex Cloud, Kubernetes, MySQL, CosmosDB, MongoDB, Go, C#, Python, Jsonnet, Prometheus, Grafana, Kustо.",
    "Административная часть: Обеспечили сбор данных и настроили мониторинг. Организовали систему дежурств для инженеров инфраструктуры и разработчиков (у дежурных инженеров и разработчиков есть пейджер, на который приходят алерты). Создали чат-бот, который умеет считать SLO и отправлять информацию о состоянии разработчикам. Разработали и провели воркшопы для разработчиков «Как работать с мониторингом» и «Как считается SLO и для чего он нужен». Разработали и автоматизировали процедуру инцидент-менеджмента (алерты, порядок реагирования, скрайбинг, постмортем)."
  ],
  "aboutDataPlatform": [
    "Задача: Создать такой инструмент, чтобы сотрудники компании могли загружать и пользоваться данными без участия команды дата-инженеров.",
    "Решение: Разработать и развивать децентрализованную платформу данных для машинного обучения, аналитики, отчетов и дашбордов.",
    "Технологии: MySQL, Kusto, DataBricks, SuperSet. Административная часть: В рамках проекта мы настроили авторизованный доступ к данным для сотрудников управляющей компании и партнеров, создали инструменты для выгрузки данных, построения аналитики, визуализации расчетов, на базе которых можно прогнозировать спрос на конкретные продукты, расход и закупку ингредиентов."
  ],
  "aboutInformationSecurity": [
    "Задача: Снизить риски наступления и последствия недопустимых/нежелательных событий для бизнеса, при этомне усложнять работу бизнес-процессов ",
    "Решение: Проработать модели угроз и провести анализ рисков, использовать технические средства защиты информации, сформировать культуру безопасности в компании. ",
    "Административная часть: Мы разработали и проводим обучающие семинары по информационной безопасности для сотрудников, управляем доступами и ведем учет активов, проводим расследования мошеннических действий, обеспечиваем соответствие требованиям регуляторов в отношении ИБ. "
  ],
  "aboutMarketplace": [
    "Задача: Предоставить возможность сторонним разработчикам, вендорам и партнерам независимо создавать приложения, расширяющие функциональность Додо ИС. Создать онлайн-площадку, где будут выкладываться доступные приложения с возможностью их подключения. ",
    "Решение: Мы создаём и поддерживаем инфраструктуру для API, помогаем командам создавать API, чтобы партнёры могли разрабатывать свои приложения для Додо ИС. Также мы разработали концепцию магазина приложений, в котором можно будет приобрести уже готовое стороннее приложение, оставить запрос на разработку или, наоборот, предложить концепцию для разработки приложения со специфической функциональностью.",
    "Технологии:",
    "Административная часть: Мы проанализировали все части и сервисы Додо ИС, определили список сервисов, для взаимодействия с которыми нужно API, провели воркшопы по работе с API для разработчиков. Разработали концепцию и сайт маркетплейса, подключили первые приложения. Архитектура / скрины ауса развитие и поддержка системы обмена сообщениями между разными частями Додо ИС Тестирование / нагрузка, веб, мобила "
  ],
  "aboutDodoPizza": [
    "Мы разрабатываем сайт для ресторанов быстрого обслуживания Додо Пицца.",
    "Задача: Разработать и поддерживать сайт Додо Пиццы, через который клиенты смогут самостоятельно оформлять онлайн-заказы на доставку. Он должен интегрироваться с Додо ИС, иметь настраиваемое меню для каждого ресторана и зоны доставки, авторизацию.",
    "Решение: Разработали с нуля дизайн и структуру сайта, которые позволяли клиентам максимально просто и удобно заказть пиццу в нужном ресторане. На постоянной основе осуществляем поддержку, тестирование и внедряем новую функциональность.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes. Для сайта: React, Redux, TypeScript",
    "Административная часть: Мы проработали сценарии поведения клиентов и настроили интеграцию сайта с Додо ИС: после того, как клиент выбирает страну, город и указывает адрес доставки, в меню отображаются те продукты, которые доступны к заказу в пиццерии, входящей в нужную зону доставки. Авторизация клиента на сайте позволяет сохранять историю заказов, участвовать в программе лояльности, видеть персональные промо-предложения. Со временем добавили новые функциональные возможности: выбор способа оплаты, возможность получить заказ в ресторане, выбор адреса по геоданным, сториз с новостями и маркетинговыми акциями, добавление или удаление ингредиентов, выбор пиццы из половинок, заказ готовых комбо-наборов с возможностью добавить дополнительные позиции, возможность оставить отзыв.  По мере открытия Додо Пиццы в новых странах понадобился перевод на другие языки. Для автоматизации мы разработали и используем собственную систему «Лингвини».",
    "Сайт: На сайте Додо Пиццы клиент может зарегистрироваться, указать адрес доставки (выбрать на карте или через строку поиска) или выбрать удобную пиццерию для заказа в зале, увидеть актуальное меню, указать время доставки, оплатить заказ удобным способом, оставить отзыв о заказе, отслеживать статус приготовления и доставки и даже наблюдать за тем, что происходит на кухне. В случае, если курьер задерживается и не приезжает вовремя, клиент увидит соответствующее уведомление на экране и получит сертификат на бесплатную пиццу при следующем заказе. В разделе «Профиль» клиенту доступна история заказов, сохраненных адресов, а также информация о его персональных бонусах (программа лояльности). "
  ],
  "aboutAllDodoMobile": [
    "Мы занимаемся разработкой мобильных приложений для ресторанов быстрого обслуживания в трех концепциях: Додо Пицца, кофейни Дринкит, донерные Донер 42. У нас есть экспертиза разработки как нативных приложений под iOS и Android, так и кросс-платформенного приложения на Flutter."
  ],
  "aboutDodoMobile": [
    "Задача Первоначально стояла задача разработать и поддерживать приложение, через которое клиенты могли легко сделать заказ на доставку в любом ресторане Додо Пиццы с мобильных устройств. Приложение должно интегрироваться с Додо ИС, иметь настраиваемое для каждой точки меню и зону доставки. В дальнейшем появились задачи по улучшению функциональных возможностей приложения и добавлению новых, например, таких как различные способы оплаты и заказ в зале.",
    "Решение: Разработали с нуля дизайн и структуру приложения, которые позволяли клиентам максимально просто и удобно заказть пиццу в нужном ресторане. Со временем адаптировали приложение на iOS для слабовидящих. На постоянной основе осуществляем поддержку, тестирование и внедряем новую функциональность.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes. Мобильные приложения написаны и поддерживаются на Swift и Kotlin.",
    "Административная часть: Мы проработали сценарии поведения клиентов и настроили интеграцию приложений с Додо ИС: после того, как клиент вручную указывает адрес доставки, в меню отображаются те продукты, которые доступны к заказу в пиццерии, входящей в нужную зону доставки. Авторизация клиента в приложении позволяет сохранять историю заказов, участвовать в программе лояльности, получать персональные промо-предложения. Со временем добавляли новые функциональные возможности: выбор способа оплаты, возможность получить заказ в ресторане, доставку до столика, выбор адреса по геоданным, сториз с новостями и маркетинговыми акциями, добавление или удаление ингредиентов, выбор пиццы из половинок, заказ готовых комбо-наборов с возможностью добавить дополнительные позиции, чат с поддержкой, возможность оставить отзыв и чаевые курьеру.  По мере открытия Додо Пиццы в новых странах мы сделали его мультиязычным: не нужно каждый раз скачивать новое приложение, можно просто выбрать нужную страну и язык в настройках. Для перевода на другие языки мы разработали и используем собственную систему «Лингвини».",
    "Приложение: В любом мобильном приложении Додо Пиццы клиент может указать адрес доставки (выбрать на карте или через строку поиска) или выбрать удобную пиццерию для заказа в зале, увидеть актуальное меню, указать время доставки, оплатить заказ удобным способом, написать в чат с поддержкой и оставить отзыв о заказе, отслеживать статус приготовления и доставки. В случае, если курьер задерживается и не приезжает вовремя, клиент увидит соответствующее уведомление в приложении и получит сертификат на бесплатную пиццу при следующем заказе. В разделе «Профиль» клиенту доступна история заказов, сохраненных адресов, а также информация о его персональных бонусах (программа лояльности).   На текущий момент в мобильном приложении Додо Пиццы можно разместить заказ в более чем 900 пиццериях в 17 странах. "
  ],
  "aboutDoner": [
    "Задача:  Создать мобильное приложение для заказа в сети донерных Донер 42, разработать для этого интерфейс, отличный от интерфейса приложения Додо Пиццы и привлекающий клиентов с целью развития нового стартапа.",
    "Решение: Разработали дизайн приложения и само мобильное приложение под iOS и Android. Повысили привлекательность приложения уникальным функционалом: сбор комбо в корзине, донер-встряска, программа лояльности с донер-коинами.",
    "Технологии: .NET 6, MySQL, RabbitMQ, Linux, Kubernetes. Мобильные приложения написаны и поддерживаются на Swift и Kotlin.",
    "Дизайн: Мы разработали новый, плавный дизайн интерфейса для улучшения клиентского опыта. Уникальные иллюстрации помогают повышать вовлеченность клиентов. Впервые в истории нашего партнерства с Додо Брэндс именно для стартапа Донер 42 была разработана тёмная тема мобильного приложения.",
    "Административная часть:  Мы адаптировали функциональность Додо ИС для реалий донерного бизнеса: в нем на то, чтобы отдать заказ, есть гораздо меньше времени, и все процессы из-за отсутствия например выпекания заказа происходят быстрее. В трекер заказов были добавлены новые этапы и убраны лишние. Была добавлена возможность подключения доставки через агрегаторы, а не только собственными курьерами, также впервые в истории нашей работы с Додо Брэндс. Была разработана функциональность для добавления Историй в мобильное приложение Донер 42, рассказывающих об обновлениях.",
    "Мобильные приложения: В мобильном приложении вне зависимости от операционной системы, и на iOS, и на Android, клиент может собрать заказ, добавить дополнительные ингридиенты в блюда, узнать о пищевой ценности продуктов, узнать время до готовности заказа, оставить отзыв. Также можно включить темную тему в приложении для комфортного заказа в темное время суток или в условиях слабой освещенности. В приложении реализованы Истории, рассказывающие в формате слайд-шоу о возможностях приложения или новых продуктах в меню. Также был разработан функционал донер-встряски: если потрясти приложение, автоматически сформируется предложенное комбо из продуктов, которое позволяет клиенту попробовать что-то новое, не задумываясь о выборе. И наконец мы разработали отдельную систему лояльность с донер-коинами, получаемыми с каждого заказа, за которые можно покупать продукты в будущих заказах.  На текущий момент в приложении можно разместить заказ в 7 точках питания в 2 странах: в России и Казахстане. "
  ],
  "aboutDrinkit": [
    "Задача:",
    "Разработать мобильное приложение Дринкит: перенести в онлайн опыт выбора продукта, кастомизации, взаимодействия с кассиром, меню, оплату.",
    "Решение:",
    "Разработали приложение, в котором создали виртуальную витрину, реализовали возможности кастомизации напитков, заказа и оплаты в приложении.",
    "Технологии .NET 6, MySQL, RabbitMQ, Linux, Kubernetes. Мобильные приложения написаны и поддерживаются на Swift и Kotlin.  Административная часть Мы разработали дизайн приложения с виртуальной видеовитриной, чтобы привлечь внимание клиентов к новым продуктам. Адаптировали функциональность Додо ИС к особенностям кофейного бизнеса: добавили сложную кастомизацию внутри продукта (выбор молока для кофейных продуктов с молоком, посыпок). Создали модульное меню, которое управляется с сервера и позволяет разным пользователям видеть разное меню в зависимости от времени суток и истории покупок. Добавили для клиентов возможность проверки адреса кофейни для избежания ошибок.  Приложение Клиент может оформить заказ в приложении и зайти в кофейню только за тем, чтобы забрать свой напиток — ему не нужно стоять в очереди и ждать, когда приготовят заказ. Он может выбрать напиток по своим предпочтениям, добавить или убрать дополнительные ингредиенты, оплатить заказ свайпом в приложении, отслеживать статус выполнения заказа. При запуске приложения клиенту показывается виртуальная видеовитрина с новинками. На основании истории заказов в приложении реализована предиктивная модель: клиенту предлагаются продукты, которые он заказывает чаще всего, с учетом его предпочтений (выбор вида молока, посыпки). "
  ],
  "aboutCourier": [
    "Задача:  Создать мобильное приложение для курьеров Додо Пицца, снижающее число ошибок и опозданий при доставке заказов, помогающее оптимизировать доставку нескольких заказов.",
    "Решение:  Реализовали курьерское приложение с автоназначением заказов по автоматически расчитываемым маршрутам, чек-листом заказа для курьера и возможностью пометить заказ как проблемный в случае опоздания клиента или оставить комментарий к адресу с его особенностями.",
    "Технологии:  .NET 6, MySQL, RabbitMQ, Linux, Kubernetes. В мобильном приложении для обеих операционных систем iOS и Android — Flutter.",
    "Административная часть:  Мы разработали умную систему автоназначения Небесный логист, которая автоматически собирает в один большой заказ несколько близко расположенных заказов так, чтобы курьер точно успел доставить каждый из них в срок. Также Небесный логист определяет, какой курьер забирает какой заказ, исключая ситуации, когда дальние клиенты ждут свой заказ слишком долго из-за нежелания по нему ехать. Также для менеджера смены был разработан функционал подтверждения оставленных курьером комментариев к адресам: так мы сохраняем и делаем общедоступными среди курьеров только действительно важные комментарии, такие как информация о неработающем домофоне.",
    "Мобильное приложение:  Мы разработали мобильное приложение с использованием технологии Flutter, которая позволяет одновременно разрабатывать для iOS и Android и тем самым удешевляет разработку. В приложении курьер получает уведомление о назначении заказа, узнает адрес и комментарии к нему, знает, к какому времени нужно вернуться в пиццерию после доставки и какие заказы ждут его дальше. При сборке заказа курьер может проверить сам себя по чек-листу, при использовании которого вероятность ошибки падает до нуля. При завершении сборки заказа курьер получает дополнительное напоминание по мелким дополнительным предметам, таким как соусы или салфетки, чтобы точно ничего не забыть. После доставки заказа в приложении курьер отмечает его доставленным, а если что-то идет не так: клиент не на месте, клиент ошибся адресом, — курьер может пометить заказ соответствующим флажком. По таким заказам пиццерия не должна выдавать сертфикаты за опоздания. Тем самым мы экономим деньги наших партнеров в пиццериях на лишних сертификатах и довозах забытых продуктов. "
  ]
}
