{
  "loading": [
    "Dodo Information System",
    "Version 1.02d",
    "© Dodo Brands, 2020 – до сих пор",
    "Memory (Kb): 256",
    "",
    "Loaded config:",
    "Bullshit mode [OFF]",
    "Development mode [STEP BY STEP]",
    "Refactoring mode [MEDIUM]",
    "Unit - tests [REQUIRED]",
    "Legacy code [MEDIUM]",
    "",
    "Booting from Hard Disk..."
  ],
  "help": [
    "Все доступные команды:",
    "",
    "> home",
    "> stack",
    "> business",
    "> jobs",
    "> projects",
    "> test",
    "> github",
    "> habr",
    "> vk",
    "> facebook",
    "> telegram",
    "> twitter",
    "> youtube",
    "",
    "а может и не все :)"
  ],
  "home": [
    "Hi %username%",
    "",
    "Dodo Engineering still hasn’t you.",
    "Follow the RabbitMQ.",
    "",
    "Мы – разработчики в Dodo: «blameless culture» + «no bullshit». Боремся с англицизмами, используем их и снова боремся. Создаём систему Dodo IS. Она — симбиоз ERP, HRM и CRM-систем. Она управляет всем бизнесом Dodo.",
    "",
    "Мы работаем в 15 странах. В планах весь мир. Нам нужен ты.",
    "",
    "Введи, чтобы продолжить:",
    "> business",
    "> stack",
    "> jobs",
    "> projects",
    "> test",
    "> help"
  ],
  "homeMng": [
    "Hi %username%",
    "",
    "Dodo Engineering still hasn’t you.",
    "Follow the RabbitMQ.",
    "",
    "Мы – разработчики в Dodo: «blameless culture» + «no bullshit». Боремся с англицизмами, используем их и снова боремся. Создаём систему Dodo IS. Она — симбиоз ERP, HRM и CRM-систем. Она управляет всем бизнесом Dodo.",
    "",
    "Мы работаем в 15 странах. В планах весь мир. Нам нужен ты."
  ],
  "stack": [
    "• .NET Framework, переходим постепенно на .NET Core:",
    "  ASP.NET MVC в монолите","  – 14 сервисов;",
    "  ASP.NET Core в монолите","  – 2 сервиса;",
    "  ASP.NET Core вне монолита на win серверах","  – 4 сервиса;",
    "  ASP.NET Core вне монолита в k8s","  – 24 сервиса.",
    "",
    "• На сайте React + TypeScript, в бекофисе мигрируем с jQuery, Angular первых версий тоже на React + TypeScript.",
    "",
    "• 36 баз MySql на кластерах, кроме dev окружений.",
    "",
    "• Всё на Azure, с использованием RabbitMQ (местами Kafka, Azure Event Hubs), Kusto, CosmosDB, Redis и еще много мелких радостей.",
    "",
    "• Все новые сервисы мы пишем на .NET, под Linux, запускаем в Kubernetes.",
    "",
    "• Детальный мониторинг на продакшене на базе Prometheus, сбор логов в Kusto, визуализация в Grafana, пейджер для дежурного в PagerDuty.",
    "",
    "• Работа по скраму с ежедневными стендапами, планированием, общением с бизнесом.",
    "",
    "",
    "Посмотреть наши проекты можно тут:"
  ],
  "projects": [
    "Мы занимаемся сайд-проектами:"
  ],
  "business": [
    "Для создания всемирной системы Dodo IS нам нужно больше разработчиков.",
    "",
    "Бизнес – это 700+ точек питания в 15 странах (Великобритания, Штаты, Нигерия etc.), 16 000 000 клиентов, 170 заказов в минуту (стандарт), 290 заказов в минуту (в пики), 365 заказов в минуты (зафиксированный максимум), 800 заказов в минуту (держим в нагрузочном тестировании), 3000 RPS, 26 млрд рублей – выручка сети за прошлый год.",
    "",
    "Dodo IS – это коллаборация ERP+HRM+CRM-систем, которую мы пишем сами. Бонусом драйвим клиентские сайты и мобильное приложение.",
    "",
    "Приходи, мы платим не пиццей, а деньгами. Ещё есть опцион.",
    "",
    "Почитать о бизнесе можно тут:"
  ],
  "jobs": [],
  "jobs.backup": [
    "Мы работаем небольшими",
    "кросс-функциональными командами",
    "по 4-5 человек. Сегодня у нас 25 команд, а хотим 30.",
    "",
    "FYI: есть тема с удалёнкой и релокацией.",
    "",
    "Сейчас мы ищем: "
  ],
  "test": [
    "Эй, кожаный мешок, ты заснул 31 декабря 2020 года, а проснулся 1 января 2120. Сейчас мы возьмём твою ДНК и проведём тест, чтобы выдать новую профессию."
  ],
  "notexist": [
    "Такой команды нет, для списка всех команд введи:",
    "",
    "> help"
  ],
  "pizza": [
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣶⣶⣦⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣷⣤⠀⠈⠙⢿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⣿⠆⠰⠶⠀⠘⢿⣿⣿⣿⣿⣿⣆⠀⠀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⠏⠀⢀⣠⣤⣤⣀⠙⣿⣿⣿⣿⣿⣷⡀⠀",
    "⠀⠀⠀⠀⠀⠀⠀⠀⢠⠋⢈⣉⠉⣡⣤⢰⣿⣿⣿⣿⣿⣷⡈⢿⣿⣿⣿⣿⣷⡀",
    "⠀⠀⠀⠀⠀⠀⠀⡴⢡⣾⣿⣿⣷⠋⠁⣿⣿⣿⣿⣿⣿⣿⠃⠀⡻⣿⣿⣿⣿⡇",
    "⠀⠀⠀⠀⠀⢀⠜⠁⠸⣿⣿⣿⠟⠀⠀⠘⠿⣿⣿⣿⡿⠋⠰⠖⠱⣽⠟⠋⠉⡇",
    "⠀⠀⠀⠀⡰⠉⠖⣀⠀⠀⢁⣀⠀⣴⣶⣦⠀⢴⡆⠀⠀⢀⣀⣀⣉⡽⠷⠶⠋⠀",
    "⠀⠀⠀⡰⢡⣾⣿⣿⣿⡄⠛⠋⠘⣿⣿⡿⠀⠀⣐⣲⣤⣯⠞⠉⠁⠀⠀⠀⠀⠀",
    "⠀⢀⠔⠁⣿⣿⣿⣿⣿⡟⠀⠀⠀⢀⣄⣀⡞⠉⠉⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠀⡜⠀⠀⠻⣿⣿⠿⣻⣥⣀⡀⢠⡟⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⢰⠁⠀⡤⠖⠺⢶⡾⠃⠀⠈⠙⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
    "⠈⠓⠾⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
  ],
  "game": [],
  "privatePolicy_ru": [
    "Политика обработки персональных данных",
    "мобильного приложения “Додо Курьер”",
    "(действует с 19 мая 2021 г.)",
    "1. Термины и определения, используемые в настоящем Пользовательском соглашении",
    "1.1. Для целей настоящей Политики обработки персональных данных (далее - Политика), если из содержания не следует иное, используемые приведенные ниже термины с заглавной буквы имеют следующие значения.",
    "1.1.1. Персональные данные -  персональные данные Клиента и персональные данные Курьера, под которыми понимаются следующие данные:",
    "1.1.1.1. Персональные данные Клиента: имя (в том числе псевдоним); адрес доставки; номер мобильного телефона; адрес электронной почты; а также иные данные, которые Пользователь может указать/предоставить комментарии к Заказу. Полный перечень Персональных данных Клиента указывается в ячейке Заказа.",
    "1.1.1.2. Персональные данные Курьера: имя и фамилия; место нахождения (геолокационные данные); номер мобильного телефона; информация о версии операционной системы на мобильном устройстве Курьера и модели его мобильного устройства; адрес электронной почты; IP-адрес; информация из cookie; данные автомобиля, если способ передвижения Курьера - автомобиль.",
    "1.1.2. Заказ - заказ Клиента, содержащий информацию о Товарах, Клиенте (имя, номер мобильного телефона, адрес доставки) и стоимости заказа. Заказ адресуется тем Курьерам, которые зарегистрированы в Мобильном приложении и оказывают услуги или работают по трудовому договору с Пиццерией, к которой поступил Заказ.",
    "1.1.3. Клиент - лицо, которому Курьер должен доставить Товары в соответствии с Заказом.",
    "1.1.4. Компания - Общество с ограниченной ответственностью «Додо Франчайзинг», ОГРН 1131101001844, 167001, Республика Коми, г. Сыктывкар, Октябрьский проспект, 16. Компания обеспечивает возможность ознакомления Курьеров с условиями Заказов в Мобильном приложении и принятия Заказов Курьерами с целью их доставки до Клиентов.",
    "1.1.5. Курьер -  зарегистрированный в качестве курьера Пользователь - ",
    "- физическое лицо, или", 
    "- физическое лицо, являющееся плательщиком налога на профессиональный доход (самозанятый), если применимо, или", 
    "- индивидуальный предприниматель,",
    "и доставляющий Заказы Клиентам на основании трудового договора или договора оказания услуг, заключенного в Пиццерии, в том числе с помощью автомобиля, велосипеда. Для доступа к Заказам Курьер использует Мобильное приложение. Курьер должен иметь учетную запись в Додо ИС.",
    "1.1.6. Додо ИС - программа ЭВМ облачного типа (сайты auth.dodopizza и personal.dodopizza применимой доменной зоны), включающая свою базу данных, доступ к которой предоставляется в онлайн режиме через логин и пароль, способствующая автоматизации бизнес-процессов сети пиццерий “Додо Пицца”. Додо ИС принадлежит Компании.",
    "1.1.7. Личный кабинет Курьера - специальный раздел Мобильного приложения, доступ к которому Курьер получает после прохождения процедуры регистрации и предоставления всех необходимых данных Менеджеру офиса (перечень данных указан в Пользовательском соглашении сайтов auth.dodopizza и personal.dodopizza применимой доменной зоны). После предоставления всех запрашиваемых данных и прохождения процедуры регистрации Курьер получает доступ к Мобильному приложению и может его использовать.",
    "1.1.8. Менеджер офиса - сотрудник Пиццерии, основной сферой деятельности которой является эффективность работы персонала Пиццерии. Правомочия Менеджера офиса указаны в Пользовательском соглашении сайтов auth.dodopizza и personal.dodopizza применимой доменной зоны.",
    "1.1.9. Мобильное приложение - мобильное приложение “Додо Курьер”, размещенное на Платформах и позволяющее Курьерам самостоятельно следить за Заказами и принимать их для доставки Клиентам. Мобильное приложение принадлежит Компании и является составной частью Додо ИС.",
    "1.1.10 Пиццерия - пиццерия “Додо Пицца”, чьи Товары доставляет Курьер в Заказах.",
    "1.1.11. Платформа:",
    "- Apple Store для iOS (https://apps.apple.com/ru/app/%D0%B4%D0%BE%D0%B4%D0%BE-%D0%BA%D1%83%D1%80%D1%8C%D0%B5%D1%80/id1530924100),",
    "- Play Market для Android (https://play.google.com/store/apps/details?id=com.dodopizza.driveapp&hl=ru),",
    "- App Gallery для Huawei (https://appgallery.huawei.com/#/app/C102934347)",
    "1.1.12. Территория действия Мобильного приложения - территория Республики Беларусь, Республики Казахстан, Республики Узбекистан, Республики Таджикистан, Киргизской Республики, Соединенного Королевства Великобритании и Северной Ирландии, Литовской Республики, Эстонской Республики, Республики Польша, Румынии, Федеративной Республики Германия, Республики Словения, Федеративной Республики Нигерия, Социалистической Республики Вьетнам.",
    "1.1.13. Товары - товары сети пиццерий “Додо Пицца”, которые представлены на клиентском сайте применимой доменной зоны (например, клиентский сайт в России - dodopizza.ru, В Казахстане - dodopizza.kz, в Великобритании - https://dodopizza.co.uk/ и т.д.) и в Мобильном приложении “Додо Пицца. Доставка пиццы” на Платформах.",
    "1.2. Для целей Политики термины и определения в единственном числе относятся также и к терминам и определениям во множественном числе и наоборот.",
    "1.3. В Политике могут быть использованы иные термины, не определенные в настоящем разделе Политики, толкование которых производится в соответствии с текстом Политики и/или законодательством Российской Федерации, другим применимым законодательством.",
    "1.4. В случае отсутствия однозначного толкования термина в тексте Политики и/или в законодательстве Российской Федерации, другом применимом законодательстве следует руководствоваться толкованием термина, сложившимся в практике делового оборота.",
    "2. Предмет и статус Политики",
    "2.1. Политика определяет условия обработки Персональных данных.",
    "2.2. Курьер обязан полностью ознакомиться с Политикой до момента использования Мобильного приложения. ",
    "2.3. Политика заключается в электронном виде: путем регистрации Курьера в Мобильном приложении. Регистрация Курьера означает полное и безоговорочное согласие с условиями Политики. Принимая обязанность соблюдать Правила, Курьер дает свое согласие на обработку Компанией его персональных данных в соответствии с Политикой.",
    "2.4. Политика может быть изменена и/или дополнена Компанией в одностороннем порядке без какого-либо специального уведомления.",
    "2.5. К Политике и всем отношениям, вытекающим из нее, применяется законодательство Российской Федерации, другое применимое законодательство. Любые претензии и иски, вытекающие из использования Мобильного приложения на условиях Политики должны быть поданы и рассмотрены в суде по месту нахождения Компании.",
    "2.6. Действие Политики распространяется на все последующие обновления/новые версии Мобильного приложения.",
    "2.7. Политика вступает в силу для Курьера с момента размещения в Мобильном приложении и действует в течение неопределенного срока.",
    "3. Условия обработки Персональных данных",
    "3.1. Компания не проверяет достоверность Персональных данных. Компания исходит из того, что Курьер и Клиент предоставляют достоверную и достаточную персональную информацию, и поддерживают эту информацию в актуальном состоянии.",
    "3.2. Под обработкой Персональных данных в настоящей Политике понимается:  сбор Персональных данных, их систематизация, накопление, хранение, уточнение, извлечение, использование, передача, обезличивание, блокирование, удаление, уничтожение.",
    "3.3. Цели обработки Персональных данных:",
    "3.3.1. в отношении Клиентов:",
    "3.3.1.1. обработка Заказа;",
    "3.3.1.2. оценка качества оказания услуг;",
    "3.3.1.3. ведение учета Клиентов",
    "3.3.2. в отношении Курьеров:",
    "3.3.2.1. ведение учета Курьеров как пользователей Мобильного приложения;",
    "3.3.2.2. сбор мнений о Мобильном приложении, предложений по его улучшению;",
    "3.3.2.3. заключение и исполнение Пользовательского соглашения с Компанией об использовании Мобильного приложения;",
    "3.3.2.4. осуществление оказания услуг доставки Курьерами",
    "3.3.2.5. авторизации Курьера в Мобильном приложении;",
    "3.3.2.6. оценки и анализа работы Мобильного приложения;",
    "3.3.2.7. контроля исполнения Курьером обязательств перед Клиентами и Пиццериями.",
    "3.4. Курьер подтверждает, что отметка им чекбокса “Согласен на обработку персональных данных” означает полное согласие Курьера со всеми положениями настоящей Политики.",
    "3.5. Согласие Курьера на обработку его персональных данных действует со дня его получения Компанией в порядке п.3.4 Политики до дня отзыва согласия, посредством направления в Компанию сообщения по электронной почте на адрес support@dodopizza.com.",
    "3.6. Компания вправе передать Персональные данные Курьера третьим лицам, в том числе путем трансграничной передачи (только на территории иностранных государств, в которых обеспечен надлежащий уровень защиты персональных данных), в следующих случаях:",
    "3.6.1. для использования Курьером Мобильного приложения;",
    "3.6.2. при продаже или иной передаче бизнеса Компании (полностью или в части), при этом к приобретателю переходят все обязательства по соблюдению настоящего раздела Политики;",
    "3.6.3. в целях обеспечения возможности защиты прав и законных интересов Курьеров, Компании или третьих лиц.",
    "3.7. Компания вправе совершать автоматизированную обработку Персональных данных Курьера, в том числе с помощью Мобильного приложения в целях, предусмотренных Политикой, а также поручать обработку Персональных данных Курьера третьим лицам.",
    "3.8. Курьер настоящим уведомлен, понимает и соглашается с тем, что Мобильное приложение может собирать обезличенные статистические данные об использовании Мобильного приложения и в автоматическом режиме передавать их Компании.",
    "3.9. Курьер дает свое согласие на обработку его Персональных данных в целях оказания им услуг доставки с использованием Мобильного приложения, а также соглашается на осуществление Компанией прямых контактов с ним с помощью средств связи, а также на передачу его персональных данных третьим лицам в указанных целях.",
    "3.10. Курьер дает свое согласие на обработку данных о его местоположении (геолокационные данные) в период доставления им Заказа Клиенту. Обработка данных о местоположении (геолокационные данные) производится как при использовании Курьером Мобильного приложения, так и в случае закрытия Курьером Мобильного приложения, но всегда при осуществлении Курьером доставки Заказа Клиенту. Курьер соглашается с тем, что Компания использует данные о его местоположении (геолокационные данные) в целях уведомления Клиентов о том, где находится их Заказ, доставку которого осуществляет Курьер.",
    "3.11. Курьер вправе потребовать от Компании удаления своего профиля в Мобильном приложении и данных в Личном кабинете, направив письмо по электронной почте на адрес  support@dodopizza.com.",
    "3.12. Компания имеет право назначить лицо (оператора Компании), ответственное за организацию обработки Персональных данных.",
    "4. Защита Персональных данных Компанией и их конфиденциальность",
    "4.1. Компания принимает необходимые и достаточные организационные и технические меры для защиты Персональных данных от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.",
    "4.2. Компания устанавливает следующие меры правового, организационного и правового характера для защиты Персональных данных:",
    "4.2.1. назначено ответственное лицо по организации обработки Персональных данных;",
    "4.2.2. изданы и внедрены документы, определяющие Политику Компании в отношении обработки Персональных данных, локальные акты, устанавливающие процедуры, направленные на предотвращение и выявление нарушений законодательства Российской Федерации, другого применимого законодательства устранение последствий таких нарушений;", 
    "4.2.3. работники Компании непосредственно осуществляющие обработку Персональных данных, ознакомлены с положениями законодательства Российской Федерации, другого применимого законодательства “О персональных данных”, в том числе с требованиями к защите персональных данных, документами определяющими политику Компании в отношении обработки персональных данных, локальными актами по вопросам обработки персональных данных.",
    "4.3. Компания хранит Персональные данные, обеспечивая их конфиденциальность и защиту от неправомерного или случайного доступа к ним третьих лиц.",
    "4.4. Компания обязуется предотвращать попытки несанкционированного доступа к Персональным данным, предоставленных Компании; своевременно обнаруживать и пресекать такие попытки.",
    "4.5. Компания не несет ответственности за риск наступления неблагоприятных последствий, которые наступят или могут наступить вследствие несоответствия оборудования Курьера, используемого им программного обеспечения или каналов связи установленным требованиям по защите персональных данных от несанкционированного (противоправного) посягательства третьих лиц.",
    "4.6. Курьер обязуется не разглашать полученную от Клиента информацию (в том числе Персональные данные Клиента) третьим лицам, за исключением случаев, когда это требуется для исполнения оказания услуг по доставке Заказа, а также не хранить и не собирать Персональные данные Клиентов и других Курьеров.", 
    "4.7. В случае разглашения Курьером персональных данных о Клиентах и Курьерах, повлёкшее причинение убытков, Компания имеет право на возмещение указанных убытков в судебном порядке с Курьера. В случае причинение материального ущерба Курьер привлекается к гражданской, административной или уголовной ответственности.",
    "5. Технологии,  используемые Компанией в Мобильном приложении",
    "5.1. Компания вправе использовать технологии “NSUserDefaults” на платформе iOS и “SharedPreferences” на платформе Android для сохранения информации о Курьере.",
    "5.2. Использование технологий  “NSUserDefaults” и  “SharedPreferences” представляет собой размещение в Мобильном приложении определенного набора символов  (знаков), которые сохраняются на мобильном устройстве Курьера, с которого был выполнен вход в Мобильное приложение.", 
    "5.3. После осуществления Курьером входа в Личный кабинет, введенные Курьером на своем устройстве данные Личного кабинета могут быть автоматически сохранены на мобильном устройстве в Мобильном приложении до завершения Курьером работы в своем Личном кабинете и не требовать дополнительного ввода средств доступа при каждом использовании.",
    "5.4. Цели применения Компанией технологий “NSUserDefaults” и  “SharedPreferences”:",
    "5.4.1. статистика по активности Курьеров в Мобильном приложении;",
    "5.4.2. повышение производительности и эффективности Мобильного приложения;",
    "5.4.3. аналитика и исправление ошибок Мобильного приложения, улучшение работы всех ресурсов Мобильного приложения;",
    "5.4.4. безопасность и целостность ресурсов Мобильного приложения;"
  ],
  "privatePolicy_en": [
    "Dodo Courier",
    "Privacy Policy",
    "(Effective date: July 19, 2021)",
    "1. Terms and Definitions",
    "1.1.For the purposes of this Privacy Policy (hereinafter referred to as the Policy), the following capitalized terms shall be defined as set forth below, unless the context otherwise requires.",
    "1.1.1. Personal Data means the Customer's personal data and the Delivery Partner's personal data and includes the following:",
    "1.1.1.1. Customer's Personal Data: name (incl. pseudonym), delivery address, mobile number, email address, as well as any other data the User may specify/provide in their comment to the Order. A complete list of the Customer's Personal Data is provided in the Order box.", 
    "1.1.1.2. Delivery Partner's Personal Data: name and surname, location (location data), mobile number, information on the version of the operating system installed on the Delivery Partner's mobile device and the model of their mobile device, email address, IP address, cookie information, and information on the Delivery Partner's motor vehicle, provided a motor vehicle is specified as their mode of transport.",
    "1.1.2. The Order means a Customer's purchase order containing information on the Products, the Customer (name, mobile number, delivery address), and the order amount. Orders are forwarded to Delivery Partners who are registered in the Mobile Application and provide services or work under an employment contract with the Store that received the Order.",
    "1.1.3. The Customer means the person to whom the Delivery Partner shall deliver the Products included in the Order.",
    "1.1.4. The Company means Dodo Franchising Limited Liability Company (Primary State Registration Number 1131101001844; 16 October Avenue, Syktyvkar, Republic of Komi, Russia, 167001). The Company allows Delivery Partners to view Order details in the Mobile Application and accept Orders for delivery to Customers.",
    "1.1.5. The Delivery Partner means a User who is registered as a delivery service provider: he/she is", 
    "- a private individual, or",
    "- an income taxpayer (a self-employed person; if applicable), or", 
    "- an individual entrepreneur,", 
    "and delivers Orders to Customers under an employment contract or a service contract with a Store, including by means of a motor vehicle or bicycle. The Delivery Partner shall access Orders through the Mobile Application. The Delivery Partner must have a Dodo IS account.",
    "1.1.6. Dodo IS is a cloud-based computer program (auth.dodopizza and personal.dodopizza web pages under the applicable domain name) that includes a database accessible online with a login and a password and facilitates the automation of business processes in Dodo Pizza stores. Dodo IS is owned by the Company.", 
    "1.1.7. The Delivery Partner's Personal Account is a special section of the Mobile Application that can be accessed by the Delivery Partner after they complete the registration procedure and provide all the required information to Manager of the Office (a list of the required information can be found in the End User License Agreement for auth.dodopizza and personal.dodopizza web pages under the applicable domain name). Once the Delivery Partner provides all the requested information and completes the registration procedure, they will be granted access to the Mobile Application and can start using it.",
    "1.1.8. Manager of the Office is a Store employee whose main area of responsibility is the efficiency of the Store staff. Powers of Manager of the Office are defined in the End User License Agreement for auth.dodopizza and personal.dodopizza web pages under the applicable domain name.", 
    "1.1.9. The Mobile Application means the Dodo Courier mobile application, which is available on the Platforms and allows Delivery Partners to independently monitor Orders and accept them for delivery to Customers. The mobile Application is owned by the Company and is part of Dodo IS.", 
    "1.1.10. A Store means the Dodo Pizza store whose Products are delivered by the Delivery Partner to Customers.", 
    "1.1.11. The Platforms include:",
    "- Apple Store for iOS (https://apps.apple.com/ru/app/%D0%B4%D0%BE%D0%B4%D0%BE-%D0%BA%D1%83%D1%80%D1%8C%D0%B5%D1%80/id1530924100);", 
    "- Play Market for Android (https://play.google.com/store/apps/details?id=com.dodopizza.driveapp&hl=ru);", 
    "- App Gallery for Huawei (https://appgallery.huawei.com/#/app/C102934347).",  
    "1.1.12. The Mobile Application's Operating Territory includes the Republic of Belarus, the Republic of Kazakhstan, the Republic of Uzbekistan, the Republic of Tajikistan, the Kyrgyz Republic, the United Kingdom of Great Britain and Northern Ireland, the Republic of Lithuania, the Republic of Estonia, the Republic of Poland, Romania, the Federal Republic of Germany, the Republic of Slovenia, the Federal Republic of Nigeria, and the Socialist Republic of Vietnam.",
    "1.1.13. Products mean items offered by the Dodo Pizza chain on the website for customers under the applicable domain name (for example, the website's address is dodopizza.ru for Russia, dodopizza.kz for Kazakhstan, https://dodopizza.co.uk/ for the UK, etc.) and in the “Dodo Pizza. Pizza Delivery” Mobile Application on the Platforms.",
    "1.2. For the purposes of the Policy, terms and definitions in the singular shall also apply to terms and definitions in the plural and vice versa.",
    "1.3. The Policy may include terms that are not defined in this section of the Policy, in which case the interpretation of such terms shall be made in accordance with the text of the Policy and/or the law of the Russian Federation or other applicable law.",
    "1.4. In the absence of an unambiguous interpretation of a term in the text of the Policy and/or the law of the Russian Federation or other applicable law, the interpretation of such terms should be guided by their generally accepted meaning in business practice.",
    "2. Object and Scope of the Policy",
    "2.1. This Policy defines the terms for processing Personal Data.",
    "2.2. It is the Delivery Partner's responsibility to read the Policy in its entirety before using the Mobile Application.", 
    "2.3. The Policy is entered into by electronic means when the Delivery Partner registers in the Mobile Application. By registering in the Mobile Application, the Delivery Partner unconditionally agrees to all of the terms of this Policy. By accepting the terms of the Policy, the Delivery Partner gives their consent to the processing of their Personal Data by the Company as provided in the Policy.", 
    "2.4. The Company may unilaterally amend and/or supplement the Policy without any special notice.",
    "2.5. The Policy and all relationships arising from it are subject to the law of the Russian Federation and any other applicable law. Any claims and lawsuits arising from the use of the Mobile Application under the terms of this Policy shall be brought and heard in the court of the Company's location.", 
    "2.6. The Policy applies to all future updates/new versions of the Mobile Application.",
    "2.7. The Policy becomes binding upon the Delivery Partner immediately after its publication in the Mobile Application and shall be valid indefinitely.",
    "3. Terms of Personal Data Processing", 
    "3.1. The Company does not verify the accuracy of Personal Data. The Company assumes that the Delivery Partner and the Customer provide accurate and sufficient personal information and keep this information up to date.",
    "3.2. For the purposes of this Policy, processing of Personal Data means collection, organization, accumulation, storage, clarification, retrieval, use, transfer, depersonalization, blocking, deletion, and destruction of Personal Data.",
    "3.3. Purposes of Personal Data processing:",
    "3.3.1. in relation to Customers:", 
    "3.3.1.1. order processing;",
    "3.3.1.2. service quality assessment;",
    "3.3.1.3. maintaining a record of Customers.",
    "3.3.2. in relation to Delivery Partners:",
    "3.3.2.1. maintaining a record of Delivery Partners as users of the Mobile Application;",
    "3.3.2.2. aggregation of opinions on the Mobile Application and suggestions for its improvement;",
    "3.3.2.3. execution and performance of the End User License Agreement with the Company for the use of the Mobile Application;",
    "3.3.2.4. enabling Delivery Partners to provide delivery services;",
    "3.3.2.5. Delivery Partner authorization in the Mobile Application;",
    "3.3.2.6. assessment and analysis of the Mobile Application's performance;",
    "3.3.2.7. control of the fulfillment of the Delivery Partner's obligations to Customers and Stores.",
    "3.4. The Delivery Partner confirms that by checking the box “I agree to the processing of my personal data,” the Delivery Partner agrees to all terms of this Policy.",
    "3.5. The Delivery Partner's consent to the processing of their personal data is effective from the date of its provision to the Company, as described in clause 3.4 of the Policy, and until the date the Delivery Partner withdraws their consent by sending an email to the Company at support@dodopizza.com.",
    "3.6. The Company reserves the right to transfer the Delivery Partner's Personal Data to third parties within and outside Russia (cross-border transfers of personal data shall only be made to countries that have sufficient protection of personal data) in the following cases:",
    "3.6.1. use of the Mobile Application by the Delivery Partner;",
    "3.6.2. sale or other transfer of the Company's business (in whole or in part), where the transferee assumes all obligations to comply with the terms of this section of the Policy;",
    "3.6.3. for the purpose of ensuring the protection of the rights and legitimate interests of Delivery Partners, the Company, or third parties.",
    "3.7. The Company reserves the right to carry out automated processing of the Delivery Partner's Personal Data, including by means of the Mobile Application, for the purposes described in the Policy, as well as to entrust the processing of the Delivery Partner's Personal Data to third parties.",
    "3.8. The Delivery Partner is hereby notified, understands, and agrees that the Mobile Application may collect depersonalized statistical data on their usage of the Mobile Application and automatically transfer it to the Company.",
    "3.9. The Delivery Partner consents to the processing of their Personal Data for the purpose of providing delivery services using the Mobile Application, to direct contact by the Company by means of communication, as well as to the transfer of their personal data to third parties for the purposes described above.",
    "3.10. The Delivery Partner consents to the processing of his location data (geolocation data) during the delivery of the Order to the Client. Location data (geolocation data) is processed both when the Delivery Partner uses the Mobile Application, and when the Delivery Partner closes the Mobile Application, but always when the Delivery Partner delivers the Order to the Customer. The Delivery Partner agrees that the Company uses his location data (geolocation data) in order to notify Customers of where their Order is located, which is delivered by the Delivery Partner.",
    "3.11. The Delivery Partner may request the Company to delete their Mobile Application profile and Personal Profile data by sending an email at support@dodopizza.com.",
    "3.12. The Company reserves the right to appoint a person (Company operator) responsible for organizing the processing of Personal Data.",
    "4. Protection of Personal Data by the Company and Confidentiality",
    "4.1. The Company shall take the necessary and sufficient technical and organizational measures to protect Personal Data from an unauthorized or accidental access, destruction, modification, blocking, copying, distribution, and other illegal actions of third parties.",
    "4.2. The Company takes the following legal and organizational measures to protect Personal Data:", 
    "4.2.1. appointed a person responsible for organizing the processing of Personal Data;", 
    "4.2.2. issued and implemented documents defining the Company's Policy regarding the processing of Personal Data and by-laws establishing procedures for preventing and detecting violations of the law of the Russian Federation or other applicable law, as well as eliminating the consequences of such violations;", 
    "4.2.3. the Company employees directly involved in the processing of Personal Data are familiar with the provisions and requirements for the protection of Personal Data set forth in the law of the Russian Federation “On Personal Data” and other applicable law, as well as with documents defining the Company's policy on the processing of Personal Data and by-laws on the processing of Personal Data.",
    "4.3. The Company ensures the confidentiality of stored Personal Data and protects it from unauthorized or accidental access by third parties.",
    "4.4. The Company undertakes to prevent any attempts of unauthorized access to Personal Data provided to the Company, as well as detect and halt such attempts in a timely manner.",
    "4.5. The Company shall not be liable for any adverse consequences that arise or may arise as a result of non-compliance of the equipment, software, or communication channels used by the Delivery Partner with the established requirements for the protection of Personal Data from unauthorized (unlawful) encroachment by third parties.",
    "4.6. The Delivery Partners shall not disclose any information received from the Customer (including the Customer's Personal Data) to third parties, except when it is required to perform Order delivery services, nor shall they store or collect Personal Data of Customers or other Delivery Partners.", 
    "4.7. In the event of disclosure of Personal Data of Customers or Delivery Partners by the Delivery Partner, the Company reserves the right to seek any resulting damage from the Delivery Partner in court. The Delivery Partner shall be held civilly, administratively, or criminally liable for any material damage caused as a result of such actions.",
    "5. Technologies Used by the Company in the Mobile Application",
    "5.1. The Company shall use NSUserDefaults on iOS and SharedPreferences on Android for saving information about the Delivery Partner.",
    "5.2. The use of NSUserDefaults and SharedPreferences technologies constitutes the inclusion of a certain sequence of characters in the Mobile Application and saving it on the mobile device used by the Delivery Partner to access the Mobile Application.", 
    "5.3. After the Delivery Partner logs into their Personal Account, the Personal Account information entered by the Delivery Partner can be automatically saved on the mobile device through the Mobile Application until the Delivery Partner is finished working with their Personal Account, so as to avoid requesting the Delivery Partner's login details on each use.",
    "5.4. Purposes of the use of NSUserDefaults and SharedPreferences technologies by the Company:",
    "5.4.1. collection of statistics on Delivery Partner activity in the Mobile Application;",  
    "5.4.2. improvement of the performance and efficiency of the Mobile Application;",
    "5.4.3. analysis and elimination of errors in the Mobile Application; improvement of the performance of all resources of the Mobile Application;",
    "5.4.4. security and integrity of the Mobile Application's resources;"
  ]
}
